app/Controllers/CmsProduk.php

SELECT *
FROM `product`
WHERE `status` = 1
---
    public function produk_gallery()
    {
        $data['mymenu'] = "PRODUK";
        $data['mysubmenu'] = "GALERI PRODUK";
        $data['vendorcss'] = $this->plugins->cssDataTables();
        $data['vendorjs'] = $this->plugins->jsDataTables();
        $data['produk'] = $this->db->table('product')->getWhere(['status' => 1])->getResult();

SELECT *
FROM `product_gallery`
WHERE `id` = 1
---
    function delete_produk_gallery($id)
    {
        $id_ = htmlspecialchars($id, ENT_QUOTES);
        $encrypter = \Config\Services::encrypter();
        $id_dec = $encrypter->decrypt(hex2bin($id_));

        $src = $this->db->table('product_gallery')->getWhere(['id' => $id_dec])->getRow()->photo_url;