app/Controllers/Home.php

    public function blog()
    {
        $data['title'] = 'Artikel';
        $blog = new BlogModel();
        $data['konfigurasi'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
        $data['list_blog'] = $blog->Where('status', 1)->orderBy('id', 'DESC')->paginate(12, 'blog');
---
SELECT *
FROM `blog`
WHERE `status` = 1
ORDER BY `id` DESC
 LIMIT 12