app/Controllers/Home.php

    public function index()
    {
        $data['title'] = 'Home';
        $data['slider'] = $this->konfigurasi->getSlider();
        $data['testimoni'] = $this->db->table('testimoni')->getWhere(['status' => 1])->getResult();
        $data['gallery'] = $this->db->table('product_gallery')->orderBy('product_gallery.title', 'ASC')->getWhere(['status' => 1])->getResult();
        $data['product_price'] = $this->db->table('price_product')->orderBy('harga')->get()->getResult();
---
SELECT *
FROM `testimoni`
WHERE `status` = 1
SELECT *
FROM `product_gallery`
WHERE `status` = 1
ORDER BY `product_gallery`.`title` ASC
SELECT *
FROM `price_product`
ORDER BY `harga`

    public function tentang_kami()
    {
        $data['title'] = 'Profil';
        $data['main_content'] = 'home/about';
        $data['konfigurasi'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
        $data['mitra'] = $this->db->table('mitra')->getWhere(['status' => '1'])->getResult();
        $data['visi'] = $this->db->table('visimisi')->getWhere(['kategori' => 'VISI', 'status' => 1])->getResult();
        $data['misi'] = $this->db->table('visimisi')->getWhere(['kategori' => 'MISI', 'status' => 1])->getResult();
        $data['team'] = $this->db->table('pengurus')->get()->getResult();
---
SELECT *
FROM `konfigurasi`
WHERE `id` = 'SET'
SELECT *
FROM `mitra`
WHERE `status` = '1'
SELECT *
FROM `pengurus`

    public function galeri_produk()
    {
        $data['title'] = 'Profil';
        $data['main_content'] = 'home/galeri_produk';
        $data['konfigurasi'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
        $data['produk'] = $this->konfigurasi->getProduk();
        $data['kategori'] = $this->db->table('product_category')->getWhere(['status' => '1'])->getResult();
---
SELECT *
FROM `konfigurasi`
WHERE `id` = 'SET'
SELECT *
FROM `product_category`
WHERE `status` = '1'

    public function portfolio()
    {
        $data['title'] = 'Portfolio';
        $data['main_content'] = 'home/portfolio';
        $data['tag'] = $this->db->table('portfolio_tag')->groupBy('nama')->get()->getResult();
        $data['portfolio'] = $this->db->table('portfolio')->getWhere(['status' => '1'])->getResult();
        $data['konfigurasi'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
---
SELECT *
FROM `portfolio_tag`
GROUP BY `nama`
SELECT *
FROM `portfolio`
WHERE `status` = '1'
SELECT *
FROM `konfigurasi`
WHERE `id` = 'SET'

    public function portfolio_detail($id_portfolio)
    {
        $hashids = new Hashids('53qURe_portfolio', 5, 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789');
        $id = $hashids->decode($id_portfolio)[0];

        $data['title'] = 'Portfolio';
        $data['main_content'] = 'home/portfolio_detail';
        $data['konfigurasi'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
        $data['portfolio'] = $this->db->table('portfolio')->getWhere(['id' => $id])->getRow();
---
SELECT *
FROM `konfigurasi`
WHERE `id` = 'SET'
SELECT *
FROM `portfolio`
WHERE `id` = 2

    public function blog()
    {
        $data['title'] = 'Artikel';
        $blog = new BlogModel();
        $data['konfigurasi'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
        $data['list_blog'] = $blog->Where('status', 1)->orderBy('id', 'DESC')->paginate(10, 'blog');
---
SELECT COUNT(*) AS `numrows`
FROM `blog`
WHERE `status` = 1

    public function blog_search()
    {
        $q = htmlspecialchars($this->request->getGet('q'), ENT_QUOTES);

        $data['title'] = 'Artikel';
        $blog = new BlogModel();
        $data['key'] = $q;

        $data['konfigurasi'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
        $data['list_blog'] = $blog->Join('blog_tag','blog_tag.blog_id = blog.id')->Where('status', 1)->Like('blog.judul', $q)->orLike('blog.ringkasan', $q)->orderBy('id', 'DESC')->paginate(10, 'blog');
        $data['pager'] = $blog->pager;
        $data['tag'] = $this->db->table('blog_tag')->groupBy('name')->get()->getResult();
---
SELECT *
FROM `konfigurasi`
WHERE `id` = 'SET'
SELECT *
FROM `blog`
JOIN `blog_tag` ON `blog_tag`.`blog_id` = `blog`.`id`
WHERE `status` = 1
AND  `blog`.`judul` LIKE '%asdfadfhga%' ESCAPE '!'
OR  `blog`.`ringkasan` LIKE '%asdfadfhga%' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `blog`
JOIN `blog_tag` ON `blog_tag`.`blog_id` = `blog`.`id`
WHERE `status` = 1
AND  `blog`.`judul` LIKE '%asdfadfhga%' ESCAPE '!'
OR  `blog`.`ringkasan` LIKE '%asdfadfhga%' ESCAPE '!'
SELECT *
FROM `blog_tag`
GROUP BY `name`

    public function produk_search()
    {
        $data['title'] = 'Produk';
        $q = htmlspecialchars($this->request->getGet('q'), ENT_QUOTES);

        $data['key'] = $q;
        $data['konfigurasi'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
        $data['kategori'] = $this->konfigurasi->getKategoriProduk();
        $data['list_produk'] = $this->db->table('product')->where('status', 1)->like('nama', $q)->get()->getResult();
---
SELECT *
FROM `konfigurasi`
WHERE `id` = 'SET'
SELECT *
FROM `product`
WHERE `status` = 1
AND  `nama` LIKE '%sdfhaesr5hgf%' ESCAPE '!'

    public function produk_by($id_produk)
    {
        $data['title'] = 'Produk';
        $hashids = new Hashids('53qURe_produk', 5, 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789');
        $id = $hashids->decode($id_produk)[0];

        $data['konfigurasi'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
        $data['produk'] = $this->konfigurasi->getProdukById($id);
        $data['galery_produk'] = $this->db->table('product_gallery')->getWhere(['id_product' => $id])->getResult();
---
SELECT *
FROM `konfigurasi`
WHERE `id` = 'SET'
SELECT *
FROM `product_gallery`
WHERE `id_product` = 3

    public function produk_kategori($kode_kategori)
    {
        $data['title'] = 'Produk';
        $data['kategori_row'] = $this->db->table('product_category')->getWhere(['kode' => $kode_kategori])->getRow();
        $data['konfigurasi'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
---
SELECT *
FROM `product_category`
WHERE `kode` = 'images'
SELECT *
FROM `konfigurasi`
WHERE `id` = 'SET'