app/Controllers/Konfigurasi.php

    public function index()
    {
        $page['mymenu'] = "KONFIGURASI";
        $page['mysubmenu'] = "WEB";
        $page['js'] = array("profil/konfigurasi.js?r=" . rand());
        $page['main_content'] = 'cms/konfigurasi';
        $page['data'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
---
SELECT *
FROM `konfigurasi`
WHERE `id` = 'SET'

    public function update_konfigurasi()
    {
        if ($this->request->getPost()) {
            $val = $this->validate(
                [
                    'nama_company' => 'required',
                    'nama_populer' => 'required',
                    'tagline' => 'required',
                    'deskripsi' => 'required',
                    'alamat' => 'required',
                    'kota' => 'required',
                    'google_maps' => 'required',
                    'email' => 'required',
                    'telephone' => 'required',
                    'whatsapp' => 'required',
                ]
            );

            if (!$val) {
                $page['validation'] = $this->validator;
                $page['mymenu'] = "KONFIGURASI";
                $page['mysubmenu'] = "WEB";
                $page['js'] = array("profil/konfigurasi.js?r=" . rand());
                $page['main_content'] = 'cms/konfigurasi';
                $page['data'] = $this->db->table('konfigurasi')->getWhere(['id' => 'SET'])->getRow();
---
SELECT *
FROM `konfigurasi`
WHERE `id` = 'SET'