app/Models/AuthModel.php

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `email` = 'makmudin@reseller.id'
AND `status` = 1
SELECT *
FROM `user`
WHERE `email` = 'makmudin@reseller.id'
AND `status` = 1
---
    public function verify($username, $password)
    {
        $builder =  $this->db->table('user');
        $builder->select('*');
        $builder->where('email', $username);
        $builder->where('status', 1);
        $num = $builder->countAllResults(false);
        $row = $builder->get()->getRow();