app/Models/ServerSideModel.php

    public function updatePortfolio($id, $portfolio, $portfolio_tag){
        $q = $this->db->table('portfolio');
        $q->where('id', $id);
        $q->update($portfolio);

        if ($this->db->affectedRows() > 0) {
            if($portfolio_tag != NULL){
                $up = $this->db->table('portfolio_tag');
                $up->delete(['id_portfolio' => $id]);
                foreach ($portfolio_tag['listTag'] as $tag) {
                    $data=array(
                        'id_portfolio' => $id,
                        'nama' => htmlspecialchars($tag, ENT_QUOTES),
                        'edit_user' => session()->get('admin_name'),
                        'edit_date' => date('Y-m-d H:i:s')
                    );
                    $q_tag = $this->db->table('portfolio_tag');
                    $q_tag->insert($data);
---
UPDATE `portfolio` SET `title` = 'jdfg', `keterangan` = 'tesssss', `deskripsi` = '<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Sed nisi lacus sed viverra. Fringilla phasellus faucibus scelerisque eleifend donec pretium vulputate. Non arcu risus quis varius quam quisque id diam. Pellentesque adipiscing commodo elit at imperdiet dui.<br></p>', `client` = 'tozoma', `location_project` = 'Jakarta', `date_project` = '2023-04-04', `status` = '1', `edit_user` = 'Makmudin IT', `edit_date` = '2023-04-15 06:20:53'
WHERE `id` = '2'
DELETE FROM `portfolio_tag`
WHERE `id_portfolio` = '2'
INSERT INTO `portfolio_tag` (`id_portfolio`, `nama`, `edit_user`, `edit_date`) VALUES ('2', 'JIG', 'Makmudin IT', '2023-04-15 06:20:53')